; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-3degree-100mindistance-4trucks-5packages-1034seed

(define (problem transport-three-cities-sequential-4nodes-1000size-3degree-100mindistance-4trucks-5packages-1034seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 647,92 -> 842,38
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 21)
  ; 842,38 -> 647,92
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 21)
  ; 86,97 -> 647,92
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 57)
  ; 647,92 -> 86,97
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 57)
  ; 395,77 -> 842,38
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 45)
  ; 842,38 -> 395,77
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 45)
  ; 395,77 -> 647,92
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 26)
  ; 647,92 -> 395,77
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 26)
  ; 395,77 -> 86,97
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 31)
  ; 86,97 -> 395,77
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 31)
  ; 2389,776 -> 2238,776
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 16)
  ; 2238,776 -> 2389,776
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 16)
  ; 2236,189 -> 2238,776
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 59)
  ; 2238,776 -> 2236,189
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 59)
  ; 2371,333 -> 2238,776
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 47)
  ; 2238,776 -> 2371,333
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 47)
  ; 2371,333 -> 2389,776
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 45)
  ; 2389,776 -> 2371,333
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 45)
  ; 2371,333 -> 2236,189
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 20)
  ; 2236,189 -> 2371,333
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 20)
  ; 1060,2291 -> 1017,2161
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 14)
  ; 1017,2161 -> 1060,2291
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 14)
  ; 1580,2468 -> 1060,2291
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 55)
  ; 1060,2291 -> 1580,2468
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 55)
  ; 1736,2237 -> 1580,2468
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 28)
  ; 1580,2468 -> 1736,2237
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 28)
  ; 842,38 <-> 2236,189
  (road city-1-loc-1 city-2-loc-3)
  (= (road-length city-1-loc-1 city-2-loc-3) 141)
  (road city-2-loc-3 city-1-loc-1)
  (= (road-length city-2-loc-3 city-1-loc-1) 141)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 158)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 158)
  (road city-2-loc-4 city-3-loc-3)
  (= (road-length city-2-loc-4 city-3-loc-3) 185)
  (road city-3-loc-3 city-2-loc-4)
  (= (road-length city-3-loc-3 city-2-loc-4) 185)
  (at package-1 city-2-loc-4)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-2)
  (at package-4 city-3-loc-1)
  (at package-5 city-3-loc-4)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-1-loc-3)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-3)
  (at truck-4 city-1-loc-2)
  (capacity truck-4 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-2-loc-4)
  (at package-3 city-3-loc-3)
  (at package-4 city-3-loc-4)
  (at package-5 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-4 city-1-loc-2 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-1-loc-2) (capacity truck-4 capacity-4)
   added: (in package-3 truck-4) (capacity truck-4 capacity-3)
   goals met: 0 of 5
2. (drive truck-4 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-4 city-1-loc-2)
   added: (at truck-4 city-1-loc-1)
   goals met: 0 of 5
3. (pick-up truck-4 city-1-loc-1 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-1) (capacity truck-4 capacity-3)
   added: (in package-2 truck-4) (capacity truck-4 capacity-2)
   goals met: 0 of 5
4. (drive truck-4 city-1-loc-1 city-3-loc-1)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-3-loc-1)
   goals met: 0 of 5
5. (pick-up truck-4 city-3-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-3-loc-1) (capacity truck-4 capacity-2)
   added: (in package-4 truck-4) (capacity truck-4 capacity-1)
   goals met: 0 of 5
6. (drive truck-4 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-4 city-3-loc-1)
   added: (at truck-4 city-3-loc-2)
   goals met: 0 of 5
7. (drive truck-4 city-3-loc-2 city-3-loc-3)
   deleted: (at truck-4 city-3-loc-2)
   added: (at truck-4 city-3-loc-3)
   goals met: 0 of 5
8. (drop truck-4 city-3-loc-3 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-4) (capacity truck-4 capacity-1)
   added: (at package-3 city-3-loc-3) (capacity truck-4 capacity-2)
   goals met: 1 of 5
9. (drive truck-4 city-3-loc-3 city-3-loc-4)
   deleted: (at truck-4 city-3-loc-3)
   added: (at truck-4 city-3-loc-4)
   goals met: 1 of 5
10. (pick-up truck-4 city-3-loc-4 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-3-loc-4) (capacity truck-4 capacity-2)
   added: (in package-5 truck-4) (capacity truck-4 capacity-1)
   goals met: 1 of 5
11. (drop truck-4 city-3-loc-4 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-4) (capacity truck-4 capacity-1)
   added: (at package-4 city-3-loc-4) (capacity truck-4 capacity-2)
   goals met: 2 of 5
12. (drive truck-4 city-3-loc-4 city-3-loc-3)
   deleted: (at truck-4 city-3-loc-4)
   added: (at truck-4 city-3-loc-3)
   goals met: 2 of 5
13. (drive truck-4 city-3-loc-3 city-2-loc-4)
   deleted: (at truck-4 city-3-loc-3)
   added: (at truck-4 city-2-loc-4)
   goals met: 2 of 5
14. (drop truck-4 city-2-loc-4 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-4) (capacity truck-4 capacity-2)
   added: (at package-2 city-2-loc-4) (capacity truck-4 capacity-3)
   goals met: 3 of 5
15. (drop truck-4 city-2-loc-4 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-4) (capacity truck-4 capacity-3)
   added: (at package-5 city-2-loc-4) (capacity truck-4 capacity-4)
   goals met: 4 of 5
16. (pick-up truck-4 city-2-loc-4 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-2-loc-4) (capacity truck-4 capacity-4)
   added: (in package-1 truck-4) (capacity truck-4 capacity-3)
   goals met: 4 of 5
17. (drive truck-4 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-4 city-2-loc-4)
   added: (at truck-4 city-2-loc-3)
   goals met: 4 of 5
18. (drive truck-4 city-2-loc-3 city-1-loc-1)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-1-loc-1)
   goals met: 4 of 5
19. (drop truck-4 city-1-loc-1 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-3)
   added: (at package-1 city-1-loc-1) (capacity truck-4 capacity-4)
   goals met: 5 of 5
